In the terminal:

ssh -i ~/.ssh/id_rsa dana@54.202.92.12

psql   
\connect baseball #connect to baseball database   
\d #show tables   
DROP TABLE master; # remove a table

In [1]:
#import sqlalchemy
from sqlalchemy import create_engine

import pandas as pd
from sshtunnel import SSHTunnelForwarder

In [2]:

AWS_IP_ADDRESS = '54.188.60.161'
AWS_USERNAME = 'dana'
SSH_KEY_PATH = '/Users/dana/.ssh/id_rsa'

server = SSHTunnelForwarder(
    AWS_IP_ADDRESS,
    ssh_username=AWS_USERNAME,
    ssh_pkey=SSH_KEY_PATH,
    remote_bind_address=('localhost', 5432),
)

server.start()
print(server.is_active, server.is_alive, server.local_bind_port)

True True 50091

In [3]:

# Postgres username, password, and database name
POSTGRES_IP_ADDRESS = 'localhost' ## This is localhost because SSH tunnel is active
POSTGRES_PORT = str(server.local_bind_port)
POSTGRES_USERNAME = 'dana'     ## CHANGE THIS TO YOUR POSTGRES USERNAME
POSTGRES_PASSWORD = 'dana'     ## CHANGE THIS TO YOUR POSTGRES PASSWORD
POSTGRES_DBNAME = 'baseball'

# A long string that contains the necessary Postgres login information
postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
                .format(username=POSTGRES_USERNAME, 
                        password=POSTGRES_PASSWORD,
                        ipaddress=POSTGRES_IP_ADDRESS,
                        port=POSTGRES_PORT,
                        dbname=POSTGRES_DBNAME))

# Create the connection
cnx = create_engine(postgres_str)

### 1. What was the total spent on salaries by each team, each year?

In [4]:
sql_query = '''SELECT teamid, yearid, SUM(salary) as total
               FROM salaries 
               GROUP BY teamid, yearid
               ORDER BY teamid;'''

pd.read_sql_query(sql_query, cnx)

    teamid  yearid        total
0      ANA    2001   47535167.0
1      ANA    2004  100534667.0
2      ANA    2003   79031667.0
3      ANA    2000   51464167.0
4      ANA    1998   41281000.0
5      ANA    2002   61721667.0
6      ANA    1997   31135472.0
7      ANA    1999   55388166.0
8      ARI    2000   81027833.0
9      ARI    2001   85082999.0
10     ARI    2010   60718166.0
11     ARI    2011   53639833.0
12     ARI    2004   69780750.0
13     ARI    1999   68703999.0
14     ARI    2002  102819999.0
15     ARI    2003   80657000.0
16     ARI    1998   32347000.0
17     ARI    2008   66202712.0
18     ARI    2005   62329166.0
19     ARI    2012   73804833.0
20     ARI    2006   59684226.0
21     ARI    2009   73115666.0
22     ARI    2013   90132000.0
23     ARI    2007   52067546.0
24     ATL    1996   49698500.0
25     ATL    2000   84537836.0
26     ATL    1995   47235445.0
27     ATL    2006   90156876.0
28     ATL    2008  102365683.0
29     ATL    2010   84423666.0
..     ...     ...          ...
798    TOR    2006   71365000.0
799    TOR    2011   62567800.0
800    TOR    1996   29555083.0
801    TOR    1986   12611047.0
802    TOR    1997   47079833.0
803    TOR    1985    8812550.0
804    TOR    2010   62234000.0
805    TOR    2001   76895999.0
806    TOR    2002   76864333.0
807    TOR    1989   16261666.0
808    TOR    1987   10479501.0
809    TOR    1992   44788666.0
810    TOR    1995   50590000.0
811    TOR    1998   51376000.0
812    TOR    2009   80538300.0
813    TOR    2008   97793900.0
814    TOR    1988   12241225.0
815    TOR    2000   44838332.0
816    TOR    1999   45444333.0
817    TOR    1994   43433668.0
818    TOR    2012   75009200.0
819    WAS    2012   80855143.0
820    WAS    2008   54961000.0
821    WAS    2006   63143000.0
822    WAS    2013  113703270.0
823    WAS    2011   63856928.0
824    WAS    2010   61400000.0
825    WAS    2009   59928000.0
826    WAS    2007   36947500.0
827    WAS    2005   48581500.0

[828 rows x 3 columns]

### 2. What is the first and last year played for each player?   
Hint: Create a new table from 'Fielding.csv'.

On AWS in psql, create a new table called Fielding and populate with data

```sql   
CREATE TABLE IF NOT EXISTS Fielding (   
        playerID varchar(20) NOT NULL,   
        yearID int NOT NULL,   
        stint int NOT NULL,   
        teamID text DEFAULT NULL,   
        lgID text DEFAULT NULL,
        POS text DEFAULT NULL,
        G int DEFAULT NULL,
        GS double precision DEFAULT NULL,
        InnOuts double precision DEFAULT NULL,
        PO double precision DEFAULT NULL,
        A double precision DEFAULT NULL,
        E double precision DEFAULT NULL,
        DP double precision DEFAULT NULL,
        PB double precision DEFAULT NULL,
        WP double precision DEFAULT NULL,
        SB double precision DEFAULT NULL,
        CS double precision DEFAULT NULL,
        ZR double precision DEFAULT NULL,
        PRIMARY KEY (playerID, yearID,POS,stint)
);
```

then load the data into the table

```sql
COPY Fielding FROM '/home/dana/baseballdata/Fielding.csv' DELIMITER ',' CSV HEADER;
```

In [6]:
sql_query = '''SELECT playerid, min(yearid), max(yearid)
               FROM Fielding 
               GROUP BY playerid;'''

pd.read_sql_query(sql_query, cnx)

        playerid   min   max
0      gagnied01  1914  1915
1      ramospe01  1955  1970
2      putkolu01  2012  2013
3      boyerke01  1955  1969
4      dillibo01  1946  1951
5      jeterde01  1995  2013
6      sperrst01  1936  1938
7      vidrojo01  1997  2008
8      izturce01  2001  2013
9      clarkda06  2007  2007
10     mcglike01  1999  2000
11     hendero01  1994  1998
12     guantce01  1982  1990
13     smithto04  1973  1977
14     rickedi01  1959  1959
15     smithbi03  1886  1886
16     pitkoal01  1938  1939
17     webstle01  1989  2000
18      coledi01  1951  1957
19     starkma01  1987  1990
20     wilshwh01  1934  1936
21     patteda02  1968  1974
22     ventuvi01  1945  1945
23     jonesja03  1941  1948
24     hallmbi01  1888  1903
25     daviswi02  1960  1979
26     howariv01  1914  1917
27     asselbr01  1976  1981
28     trlicri01  1992  1997
29     lindsjo01  2010  2010
...          ...   ...   ...
17951  ulricdu01  1925  1927
17952   dealch01  1912  1921
17953  dunleja01  1903  1905
17954  mosolji01  1929  1933
17955  casanpa01  1965  1974
17956  esmonji01  1911  1915
17957  giustda01  1962  1977
17958  larkiba01  1986  2004
17959  catonho01  1917  1920
17960  chilepe01  1899  1900
17961  chrisru01  1942  1948
17962  bentlcy01  1872  1872
17963  mcguijo01  1876  1884
17964  wolfebr01  2007  2009
17965  stuarma01  1949  1954
17966  hestela01  1901  1901
17967  kennebi01  1942  1947
17968  dolanto01  1879  1888
17969  brainda01  1901  1908
17970  drucklo01  1909  1912
17971  mcgowbe01  1922  1937
17972  filipst01  1944  1948
17973  odonnjo01  1884  1884
17974  caithge01  1934  1934
17975  hortoel01  1896  1898
17976  rebelar01  1938  1945
17977  craigpe01  1964  1966
17978  tayloaa01  2002  2004
17979  encarlu01  1990  1990
17980   longje01  1964  1964

[17981 rows x 3 columns]

### 3. Who has played the most all star games?

In [7]:
sql_query = '''SELECT playerID, COUNT(yearID) AS num
               FROM AllstarFull 
               GROUP BY playerID
               ORDER BY num DESC
               LIMIT 1;'''

pd.read_sql_query(sql_query, cnx)

    playerid  num
0  aaronha01   25

### 4. Which school has generated the most distinct players? Hint: Create new table from 'CollegePlaying.csv'.

On AWS in psql, create a new table called Fielding and populate with data

```sql   
CREATE TABLE IF NOT EXISTS SchoolsPlayers (   
        playerID varchar(20) NOT NULL,   
        schoolID varchar(20) NOT NULL,   
        yearMin int NOT NULL,   
        yearMax int NOT NULL,
        PRIMARY KEY (playerID, schoolID)
);
```

then load the data into the table

```sql
COPY SchoolsPlayers FROM '/home/dana/baseballdata/SchoolsPlayers.csv' DELIMITER ',' CSV HEADER;
```

In [8]:
sql_query = '''SELECT schoolID, COUNT(playerID) AS num
               FROM SchoolsPlayers 
               GROUP BY schoolID
               ORDER BY num DESC
               LIMIT 1;'''

pd.read_sql_query(sql_query, cnx)

  schoolid  num
0      usc  102

### 5. Which players have the longest career? Assume that the debut and finalGame columns comprise the start and end, respectively, of a player's career. Hint: Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the DATE function and can then be subtracted from each other yielding their difference in days.

On AWS in psql, create a new table called Master and populate with data

```sql   
CREATE TABLE IF NOT EXISTS Master (   
        playerID varchar(20) NOT NULL,   
        nameFirst varchar(20),   
        nameLast varchar(20),   
        debut varchar(20), 
        finalGame varchar(20),
        PRIMARY KEY (playerID)
);
```

then load the data into the table

```sql
COPY Master FROM PROGRAM 'cut -d "," -f 1,14,15,21,22 /home/dana/baseballdata/Master.csv' DELIMITER ',' CSV HEADER;
```

In [9]:
sql_query = '''SELECT nameFirst, nameLast, DATE(finalGame)-DATE(debut) AS diff
               FROM Master 
               WHERE debut IS NOT NULL
               GROUP BY playerID
               ORDER BY diff DESC
               LIMIT 1;'''

pd.read_sql_query(sql_query, cnx)

  namefirst namelast   diff
0      Nick  Altrock  12862

### 6. What is the distribution of debut months? Hint: Look at the DATE and EXTRACT functions.

In [10]:
sql_query = '''SELECT EXTRACT(MONTH from DATE(debut)) as m
               FROM Master 
               WHERE debut IS NOT NULL
               GROUP BY m;'''

pd.read_sql_query(sql_query, cnx)

      m
0   8.0
1   5.0
2   9.0
3   4.0
4  10.0
5   7.0
6   6.0
7   3.0

### 7. What is the effect of table join order on mean salary for the players listed in the main (master) table? Hint: Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.

In [11]:
sql_query = '''SELECT AVG(salaries.salary)
               FROM Master 
               LEFT JOIN salaries ON Master.playerID=salaries.playerID;'''

pd.read_sql_query(sql_query, cnx)

            avg
0  1.864357e+06

In [12]:
sql_query = '''SELECT AVG(salaries.salary)
               FROM salaries
               LEFT JOIN Master ON Master.playerID=salaries.playerID;'''

pd.read_sql_query(sql_query, cnx)

            avg
0  1.864357e+06

There is no effect on JOIN order

In [13]:
# close connection
server.close()